thmalmeida/STM32F10y/src/acionna.h
/*
 * acionna.h
 *
 *  Created on: 14 de fev de 2017
 *      Author: titi
 */

#ifndef ACIONNA_H_
#define ACIONNA_H_

#define stm32f1

#ifdef atmega

#define k1_on()				PORTD |=  (1<<2);
#define k1_off()			PORTD &= ~(1<<2);
#define k2_on()				PORTD |=  (1<<3);
#define k2_off()			PORTD &= ~(1<<3);
#define k3_on()				PORTD |=  (1<<4);
#define k3_off()			PORTD &= ~(1<<4);
#define drive_led_on()		PORTB |=  (1<<5);
#define drive_led_off()		PORTB &= ~(1<<5);

#define DefOut_k1()			DDRD |=  (1<<2);
#define DefOut_k2()			DDRD |=  (1<<3);
#define DefOut_k3()			DDRD |=  (1<<4);
#define DefOut_led()		DDRB |=  (1<<5);

#define DefIn__Rth()		DDRD &= ~(1<<6);
#define DefIn__read_k1()	DDRD &= ~(1<<5);
#define DefIn__read_k3()	DDRD &= ~(1<<7);


//#define readPin_Rth			(~PIND & 0b10000000)
#define readPin_k1_PIN		bit_is_set(PIND, 2)

#define readPin_k1			bit_is_clear(PIND, 5)
#define readPin_Rth			bit_is_clear(PIND, 6)
#define readPin_k3			bit_is_clear(PIND, 7)

#else

#include <stm32f10x.h>

#include "Modules/nRF24L01p.h"
#include "Hardware/rtc.h"
#include "Hardware/adc.h"
#include "Hardware/usart.h"
#include "Hardware/spi.h"
#include "Hardware/gpio.h"
#include "Hardware/EE.h"
#include <ctime>

#define pin_out_led 1
#define pin_out_k1	4
#define pin_out_k2	2
#define pin_out_k3	3
#define pin_in_Rth	5
#define pin_in_k1	6
#define pin_in_k3	7

#define pin_analog_PRess 1
#define pin_analog_LL 2
#define pin_analog_ML 3
#define pin_analog_HL 4


#define startTypeK	1		// 1-Partida direta: monofásico; 2-Partida direta: trifásico; 3-Partida estrela/triangulo

enum states01 {
	redTime,
	greenTime
};
enum states01 periodo = redTime;

SPI SerialSPI;
USART Serial;
EEPROM 	eeprom;
nRF24L01p radio;
RTCi rtc;

class ACIONNA : public GPIO , ADC {
public:

	tmElements_t tm;

	int PRess;								// last pressure converted;
	int PRessHold;							// max pressure converted on turned on period;

	uint8_t stateMode = 0;					// currently state mode machine;
	uint8_t motorStatus = 0;				// motor state: 1- on, 0- off;
	uint16_t motorTimerE = 0;				// time elapsed to turn load off;
	uint8_t PRessureRef = 0;				// max threshold pressure;
	uint8_t PRessureRef_Valve = 0;			// max threshold valve pressure to turn open;
	uint8_t PRessureMax_Sensor = 100; 		// sensor max pressure [psi]
	uint8_t PRessurePer = 85;				// percent pressure bellow nominal to turn load off;
	uint8_t PRessureRef_Low = 10;
	uint16_t levelRef_10bit = 0;			// digital 10 bit number to threshold level sensor;

	uint8_t flag_Th = 0;					// thermal relay
	uint8_t flag_waitPowerOn = 1;			// Minutes before start motor after power line ocasionally down

	uint8_t flag_PressureUnstable = 1;
	uint8_t flag_PressureDown = 0;			// flag for pressure down occurrence;
	uint8_t flag_timeMatch = 0;				// flag when turn on time occurs;

	uint8_t nTM;							// number of turn on in one day;
	uint8_t HourOnTM[9];
	uint8_t MinOnTM[9];

	static const int nLog = 7;				// Logs
	uint8_t reasonV[nLog];
	uint8_t hourLog_ON[nLog], minuteLog_ON[nLog];
	uint8_t hourLog_OFF[nLog], minuteLog_OFF[nLog];
	uint8_t dayLog_ON[nLog], monthLog_ON[nLog];
	uint8_t dayLog_OFF[nLog], monthLog_OFF[nLog];

	uint16_t levelSensorLL, levelSensorML, levelSensorHL;
	uint16_t levelSensorLL_d, levelSensorML_d, levelSensorHL_d;

	uint16_t timeOn_min = 0;
	uint8_t  timeOn_sec = 0;
	uint16_t timeOff_min = 0;
	uint8_t  timeOff_sec = 0;

	const uint8_t motorTimerStart1 = 35;	// delay on transition of k3 off and k2 on
	const uint16_t motorTimerStart2 = 200;	// delay on transition of k3 off and k2 on

	const uint8_t HourOn  = 21;				// fixed season green tax period
	const uint8_t MinOn   = 30;
	const uint8_t HourOff = 6;
	const uint8_t MinOff  = 0;

	uint8_t waitPowerOn_min_standBy = 0;	// when enabled (high) avoid load turn on;
	uint8_t waitPowerOn_min = 0;
	uint8_t waitPowerOn_sec = 0;

	volatile int flag_1s;

	void DefOut_k1();
	void DefOut_k2();
	void DefOut_k3();
	void DefOut_led();

	void DefIn__Rth();
	void DefIn__read_k1();
	void DefIn__read_k3();

	void drive_led_on();
	void drive_led_off();
	void drive_led_toggle();

	void driveMotor_ON(uint8_t startType);
	void driveMotor_OFF();

	uint8_t readPin_k1_PIN();
	uint8_t readPin_k1();
	uint8_t readPin_Rth();
	uint8_t readPin_k3();

	void begin_acn();

	void blink_led(uint8_t qnt, uint8_t time);
	void motor_start();
	void motor_stop(uint8_t reason);

	void get_levelSensors();
	double get_Pressure();

	void check_pressure();
	void check_levelSensors();
	void check_period();
	void check_timeMatch();
	void check_thermalSafe();
	void check_gpio();
	void check_TimerVar();
	void check_pressureUnstable();
	void check_pressureDown();

	void process_valveControl();
	void process_waterPumpControl();
	void process_motorPeriodDecision();
	void process_Mode();

	void summary_Print(uint8_t opt);
	void RTC_update();
	void RTC_update1();
	void refreshVariables();
	void refreshStoredData();
	void handleMessage();
	void comm_Bluetooth();

	uint8_t enableSend = 0;
	uint8_t enableTranslate = 0;
	uint8_t flagSync = 0;
	uint8_t countSync = 0;
	uint8_t flag_debug = 0;
	uint8_t flag_debug_time = 0;

	uint8_t enableDecode = 0, opcode;
	static const uint8_t sInstr_SIZE = 17;
	uint8_t k, rLength, j;
	uint8_t j2 = 0;
	uint8_t flag_frameStartBT = 0;
	uint8_t enableTranslate_Bluetooth = 0;
	char aux[3], aux2[5], inChar, sInstr[sInstr_SIZE];
	char sInstrBluetooth[30];

	uint8_t flag_01 = 0;
	uint8_t flag_02 = 0;
	uint8_t flag_03 = 0;
private:

	void k1_on();
	void k1_off();
	void k2_on();
	void k2_off();
	void k3_on();
	void k3_off();
};

void ACIONNA::begin_acn()
{
	gateConfig(pin_out_led, 1);		// Configure pin led as output;
	drive_led_off();
	gateConfig(pin_out_k1, 1);
	gateConfig(pin_out_k2, 1);
	gateConfig(pin_out_k3, 1);

	gateConfig(pin_in_k1, 0);
	gateConfig(pin_in_k3, 0);
	gateConfig(pin_in_Rth, 0);

	adc_begin();
	eeprom.begin_eeprom();
	refreshStoredData();

	rtc.begin_rtc(rtc.rtc_clkSource, rtc.rtc_PRL);	// must be after eeprom init to recover rtc.rtc_PRL on flash
}
uint8_t ACIONNA::readPin_Rth()
{
	return gateRead(pin_in_Rth, 0);
}
uint8_t ACIONNA::readPin_k1()
{
	return 	gateRead(pin_out_k1, 0);
}
uint8_t ACIONNA::readPin_k1_PIN()
{
	return gateRead(pin_out_k1, 1);
}
uint8_t ACIONNA::readPin_k3()
{
	return gateRead(pin_in_k3, 1);
}
void ACIONNA::drive_led_on()
{
	gateSet(pin_out_led, 0);
}
void ACIONNA::drive_led_off()
{
	gateSet(pin_out_led, 1);
}
void ACIONNA::drive_led_toggle()
{
	gateToggle(pin_out_led);
}
void ACIONNA::k1_on()
{
	gateSet(pin_out_k1, 1);
}
void ACIONNA::k1_off()
{
	gateSet(pin_out_k1, 0);
}
void ACIONNA::k2_on()
{
	gateSet(pin_out_k2, 1);
}
void ACIONNA::k2_off()
{
	gateSet(pin_out_k2, 0);
}
void ACIONNA::k3_on()
{

