thmalmeida/STM32F10y/src/acionna.h
	}
	else
	{
		motorStatus = readPin_k1();
	}
}
void ACIONNA::check_TimerVar()
{
	if(motorStatus)	// Load is ON;
	{
		if(timeOn_sec > 59)
		{
			timeOn_sec = 0;
			timeOn_min++;
		}
		else
		{
			timeOn_sec++;
		}
	}
	else			// Load is OFF;
	{
		if(timeOff_sec > 59)
		{
			timeOff_sec = 0;
			timeOff_min++;
		}
		else
		{
			timeOff_sec++;
		}
	}

	if(flag_waitPowerOn)
	{
		if(waitPowerOn_sec == 0)
		{
			if(waitPowerOn_min == 0)
			{
				flag_waitPowerOn = 0;
			}
			else
			{
				waitPowerOn_sec = 59;
				waitPowerOn_min--;
			}
		}
		else
		{
			waitPowerOn_sec--;
		}
	}
}
void ACIONNA::check_pressureUnstable()	// this starts to check quick variation of pressure from high to low after 2 minutes on
{
	if(stateMode == 5 && timeOn_min > 2)
	{
		if(motorStatus)
		{
			if(PRess > PRessHold)
			{
				PRessHold = PRess;
			}
			else if(PRess < ((PRessurePer/100.0)*PRessHold))
			{
				flag_PressureUnstable = 1;
			}
		}
	}
}
void ACIONNA::check_pressureDown()	// this check if pressure is still low after 3 minutes on;
{
//	if(flag_conf_pressureUnstable && (timeOn_min > 3)
	if(stateMode == 5 && (timeOn_min > 3))
	{
		if(motorStatus)
		{
			if(PRess < PRessureRef_Low)
			{
				// turn load off;
			}
		}
	}
}
void ACIONNA::process_valveControl()
{
	if(flag_timeMatch && (PRess >= PRessureRef_Valve))
	{
		flag_timeMatch &= 0;

		if(!motorStatus)
		{
			motor_start();
		}
	}
}
void ACIONNA::process_waterPumpControl()
{
	/*
	 * 0x01 - pressure
	 * 0x02 - level
	 * 0x03 - thermal
	 * 0x04 - time out
	 * 0x05 - red time
	 * 0x06 - command line
	 * 0x07 - broke pressure
	 * */

	if(!levelSensorLL)
	{
		if(motorStatus)
		{
			motor_stop(0x02);
		}
	}

	if(levelSensorHL && (stateMode == 4) && levelSensorLL)
	{
		if(!motorStatus)
		{
			motor_start();
		}
	}

	if(flag_timeMatch && (stateMode != 0) && (stateMode != 4))
	{
		flag_timeMatch = 0;

		if(!motorStatus)
		{
			motor_start();
		}
	}

	if(PRessureRef)					// Has a valid number mean this function is activated
	{
		if(PRess >= PRessureRef)
		{
			if(motorStatus)
			{
				motor_stop(0x01);
			}
		}
	}

	if(stateMode == 5)
	{
		if(motorStatus && flag_PressureUnstable)
		{
			flag_PressureUnstable = 0;
			motor_stop(0x07);
		}
	}

	if(flag_Th)
	{
		flag_Th = 0;

		motor_stop(0x03);
		stateMode = 0;
	}
}
void ACIONNA::process_motorPeriodDecision()
{
	switch (periodo)
	{
	case redTime:
		if(motorStatus)
		{
			motor_stop(0x05);
		}
		break;

	case greenTime:
		process_waterPumpControl();
		break;
	}
}
void ACIONNA::process_Mode()
{
	switch (stateMode)
	{
		case 0:	// System Down!
			break;

		case 1:	// Night Working;
			process_motorPeriodDecision();
			break;

		case 2:	// For irrigation mode. Start in a programmed time.
			process_waterPumpControl();
			break;

		case 3:	// For reservoir only. Works in a inverted pressured! Caution!
			process_valveControl();
			break;

		case 4:	// Is that for a water pump controlled by water sensors. Do not use programmed time.
			process_waterPumpControl();
			break;

		case 5:	// For irrigation mode and instantly low pressure turn motor off.
			process_waterPumpControl();
			break;

		default:
			stateMode = 0;
			Serial.println("Standby");
			break;
	}

	// maximum time drive keeps turned ON
	if(motorTimerE)
	{
		if(motorStatus)
		{
			if(timeOn_min >= motorTimerE)
			{
				motor_stop(0x04);
			}
		}
	}
}
void ACIONNA::summary_Print(uint8_t opt)
{
	switch (opt)
	{
		case 0:
			sprintf(Serial.buffer,"Time:%.2d:%.2d:%.2d %.2d/%.2d/%.4d",tm.Hour, tm.Minute, tm.Second, tm.Day, tm.Month, tm.Year+1970);
			Serial.print(Serial.buffer);

//			sprintf(Serial.buffer," UP:%.2d:%.2d:%.2d, d:%d m:%d", hour(), minute(), second(), day()-1, month()-1);
			sprintf(Serial.buffer," UP:%.2d:%.2d:%.2d, d:%d m:%d", rtc.rtc0->tm_hour, rtc.rtc0->tm_min, rtc.rtc0->tm_sec, rtc.rtc0->tm_mday-1, rtc.rtc0->tm_mon);
			Serial.println(Serial.buffer);

			sprintf(Serial.buffer," P:%d k1:%d",periodo, motorStatus);
			Serial.println(Serial.buffer);

			switch (stateMode)
			{
				case 0:
					strcpy(Serial.buffer," Modo:Desligado");
					break;

				case 1:
					sprintf(Serial.buffer," Modo:Liga Noite");
					break;

				case 2:
					if(nTM == 1)
					{
						sprintf(Serial.buffer," Irrig: Liga %dx as %2.d:%.2d", nTM, HourOnTM[0], MinOnTM[0]);
					}
					else
					{
						sprintf(Serial.buffer," Irrig: Liga %dx/dia",nTM);
					}
					break;

				case 3:
					if(nTM == 1)
					{
						sprintf(Serial.buffer," Valve: Liga %dx as %2.d:%.2d", nTM, HourOnTM[0], MinOnTM[0]);
					}
					else
					{
						sprintf(Serial.buffer," Valve: Liga %dx/dia",nTM);
					}
					break;

				case 4:
					sprintf(Serial.buffer," Modo: Auto HL");
					break;

				case 5:
					if(nTM == 1)
					{
						sprintf(Serial.buffer," IrrigLow: Liga %dx as %2.d:%.2d", nTM, HourOnTM[0], MinOnTM[0]);
					}
					else
					{
						sprintf(Serial.buffer," IrrigLow: Liga %dx/dia",nTM);
					}
					break;
					break;


				default:
					strcpy(Serial.buffer,"sMode Err");
					break;
			}
			Serial.println(Serial.buffer);
			break;

		case 1:
			int i;
			if(motorStatus)
			{
				for(i=(nLog-1);i>=0;i--)
				{
					memset(Serial.buffer,0,sizeof(Serial.buffer));
					sprintf(Serial.buffer,"OFF_%.2d: %.2d:%.2d, %.2d/%.2d ",(i+1),hourLog_OFF[i], minuteLog_OFF[i], dayLog_OFF[i], monthLog_OFF[i]);
					Serial.println(Serial.buffer);
					_delay_ms(20);

					memset(Serial.buffer,0,sizeof(Serial.buffer));
					sprintf(Serial.buffer,"ON__%.2d: %.2d:%.2d, %.2d/%.2d ",(i+1),hourLog_ON[i], minuteLog_ON[i], dayLog_ON[i], monthLog_ON[i]);
					Serial.println(Serial.buffer);
					_delay_ms(20);
				}
			}
			else
			{
				for(i=(nLog-1);i>=0;i--) //	for(i=0;i<nLog;i++)
				{
					memset(Serial.buffer,0,sizeof(Serial.buffer));
					sprintf(Serial.buffer,"ON__%.2d: %.2d:%.2d, %.2d/%.2d " ,(i+1),hourLog_ON[i], minuteLog_ON[i], dayLog_ON[i], monthLog_ON[i]);
					Serial.println(Serial.buffer);
					_delay_ms(20);

					memset(Serial.buffer,0,sizeof(Serial.buffer));
					sprintf(Serial.buffer,"OFF_%.2d: %.2d:%.2d, %.2d/%.2d ",(i+1),hourLog_OFF[i], minuteLog_OFF[i], dayLog_OFF[i], monthLog_OFF[i]);
					Serial.println(Serial.buffer);
					_delay_ms(20);
				}
			}
			sprintf(Serial.buffer,"r0:%d, r1:%d ",reasonV[0], reasonV[1]);
			Serial.println(Serial.buffer);
			break;

