thmalmeida/STM32F10y/src/acionna.h
		case 2:
			sprintf(Serial.buffer,"f:%d t1:%.2d:%.2d c%dmin t2:%.2d:%.2d s:%dmin ", flag_waitPowerOn, waitPowerOn_min, waitPowerOn_sec, waitPowerOn_min_standBy, timeOn_min, timeOn_sec, motorTimerE);
			Serial.println(Serial.buffer);
			break;

		case 3:
			sprintf(Serial.buffer,"Motor:%d Fth:%d Rth:%d Pr:%d ", motorStatus, flag_Th, readPin_Rth(), PRess);
			Serial.print(Serial.buffer);
			switch (stateMode)
			{
				case 3:
					sprintf(Serial.buffer,"Pref:%d Ptec: %d ", PRessureRef_Valve, PRessureMax_Sensor);
					Serial.println(Serial.buffer);
					break;

				case 5:
					sprintf(Serial.buffer,"Pref:%d, Pper:%d ", PRessureRef, PRessurePer);
					Serial.println(Serial.buffer);
					break;

				default:
					sprintf(Serial.buffer,"Pref:%d, Ptec: %d, Pper:%d ", PRessureRef, PRessureMax_Sensor, PRessurePer);
					Serial.println(Serial.buffer);
					break;

			}
			break;

		case 4:
			sprintf(Serial.buffer,"LL:%d ML:%d HL:%d ",levelSensorLL, levelSensorML, levelSensorHL);
			Serial.println(Serial.buffer);

			sprintf(Serial.buffer,"LL:%d ML:%d HL:%d",levelSensorLL_d, levelSensorML_d, levelSensorHL_d);
			Serial.println(Serial.buffer);
			break;

		case 5:
			for(i=0;i<nTM;i++)
			{
				sprintf(Serial.buffer,"h%d: %.2d:%.2d",i+1, HourOnTM[i], MinOnTM[i]);
				Serial.println(Serial.buffer);
			}
			break;

		case 6:
			sprintf(Serial.buffer,"tON:%.2d:%.2d ",timeOn_min, timeOn_sec);
			Serial.println(Serial.buffer);
			sprintf(Serial.buffer,"tOFF:%.2d:%.2d",timeOff_min, timeOff_sec);
			Serial.println(Serial.buffer);
			break;

		case 7:
			sprintf(Serial.buffer,"P:%d Fth:%d Rth:%d Ftm:%d k1:%d k3:%d", PRess, flag_Th, readPin_Rth(), flag_timeMatch, motorStatus, readPin_k3());
			Serial.println(Serial.buffer);

			sprintf(Serial.buffer,"LL:%d ML:%d HL:%d  ",levelSensorLL, levelSensorML, levelSensorHL);
			Serial.println(Serial.buffer);

			sprintf(Serial.buffer,"LL:%d ML:%d HL:%d  ",levelSensorLL_d, levelSensorML_d, levelSensorHL_d);
			Serial.println(Serial.buffer);
			break;

		case 8:
			sprintf(Serial.buffer,"%.2d:%.2d:%.2d %.2d/%.2d/%.4d",tm.Hour, tm.Minute, tm.Second, tm.Day, tm.Month, tm.Year+1970);
			Serial.println(Serial.buffer);
//			sprintf(Serial.buffer,"WDRF:%d BORF:%d EXTRF:%d PORF:%d", flag_WDRF, flag_BORF, flag_EXTRF, flag_PORF);
//			Serial.println(Serial.buffer);
			break;

		case 9:
			sprintf(Serial.buffer,"Err");
			Serial.println(Serial.buffer);
			break;

		default:
			sprintf(Serial.buffer,"not implemented");
			Serial.println(Serial.buffer);
			break;
	}
}
void ACIONNA::RTC_update1()
{
	rtc.getUptime();
	rtc.getTime();
	tm.Year 	= rtc.timeinfo->tm_year;
	tm.Month 	= rtc.timeinfo->tm_mon+1;
	tm.Day 		= rtc.timeinfo->tm_mday;
	tm.Hour 	= rtc.timeinfo->tm_hour;
	tm.Minute 	= rtc.timeinfo->tm_min;
	tm.Second 	= rtc.timeinfo->tm_sec;
}
void ACIONNA::RTC_update()
{
	if(tm.Second == 59)
	{
		tm.Second = 0;
		if(tm.Minute == 59)
		{
			tm.Minute = 0;
			if(tm.Hour == 23)
			{
				tm.Hour = 0;
				uint8_t month31, month30;
				if((tm.Month == 1) || (tm.Month == 3) || (tm.Month == 5) || (tm.Month == 7) || (tm.Month == 8) || (tm.Month == 10) || (tm.Month == 12))
				{
					month31 = 1;
				}
				else
				{
					month30 = 1;
				}

				if((tm.Day == 30 && month30) || (tm.Day == 31 && month31))
				{
					tm.Day = 1;
					if(tm.Month == 12)
					{
						tm.Month = 1;
						tm.Year++;
					}
					else
					{
						tm.Month++;
					}
				}
				else
				{
					tm.Day++;
				}
			}
			else
			{
				tm.Hour++;
			}
		}
		else
		{
			tm.Minute++;
		}
	}
	else
	{
		tm.Second++;
	}
}
void ACIONNA::refreshVariables()
{
	if (flag_1s)
	{
		flag_1s = 0;
//		gateToggle(1);

		RTC_update1();
//		RTC.read(tm);

		check_gpio();			// Check drive status pin;
		check_period();			// Period verify;
		check_timeMatch();		// time matches flag;
		check_TimerVar();		// drive timers

		check_pressure();		// get and check pressure system;
//		check_thermalSafe();	// thermal relay check;
		check_levelSensors();	// level sensors;

//		check_pressureDown();

		if(flag_debug)
		{
			summary_Print(7);
		}

		if(flag_debug_time)
		{
			summary_Print(8);
		}

	}
}
void ACIONNA::refreshStoredData()
{
	stateMode = eeprom.read(eeprom.pageSet, eeprom.addr_stateMode);	//eeprom_read_byte((uint8_t *)(addr_stateMode));

	if(stateMode == 0xFF)
	{
		stateMode = 0;
		eeprom.write(eeprom.pageSet, eeprom.addr_stateMode, stateMode);
		eeprom.write(eeprom.pageSet, eeprom.addr_standBy_min, 0);
		eeprom.write(eeprom.pageSet, eeprom.addr_LevelRef, 1023);
		eeprom.write(eeprom.pageSet, eeprom.addr_motorTimerE, 60);
		eeprom.write(eeprom.pageSet, eeprom.addr_PRessureRef, 60);
		eeprom.write(eeprom.pageSet, eeprom.addr_PRessureRef_Valve, 40);
		eeprom.write(eeprom.pageSet, eeprom.addr_PRessurePer, 85);
		eeprom.write(eeprom.pageSet, eeprom.addr_nTM, 1);
		eeprom.write(eeprom.pageSet, eeprom.addr_HourOnTM, 21);
		eeprom.write(eeprom.pageSet, eeprom.addr_MinOnTM, 40);
		eeprom.write(eeprom.pageSet, eeprom.addr_rtc_PRL, 40000);
		eeprom.write(eeprom.pageSet, eeprom.addr_rtc_clkSource, 0);

		Serial.println("default values");
	}

	rtc.rtc_PRL = eeprom.read(eeprom.pageSet, eeprom.addr_rtc_PRL);
	rtc.rtc_clkSource = eeprom.read(eeprom.pageSet, eeprom.addr_rtc_clkSource);

	waitPowerOn_min_standBy = eeprom.read(eeprom.pageSet, eeprom.addr_standBy_min); //eeprom_read_byte((uint8_t *)(addr_standBy_min));
	waitPowerOn_min = waitPowerOn_min_standBy;		// reset timer

//	uint8_t lbyte, hbyte;
//	hbyte = eeprom_read_byte((uint8_t *)(addr_LevelRef+1));
//	lbyte = eeprom_read_byte((uint8_t *)(addr_LevelRef));
//	levelRef_10bit = ((hbyte << 8) | lbyte);
	levelRef_10bit = eeprom.read(eeprom.pageSet, eeprom.addr_LevelRef);

//	hbyte = eeprom_read_byte((uint8_t *)(addr_motorTimerE+1));
//	lbyte = eeprom_read_byte((uint8_t *)(addr_motorTimerE));
//	motorTimerE = ((hbyte << 8) | lbyte);
	motorTimerE = eeprom.read(eeprom.pageSet, eeprom.addr_motorTimerE);

