thmalmeida/STM32F10y/src/acionna.h
	PRessureRef = eeprom.read(eeprom.pageSet, eeprom.addr_PRessureRef); //eeprom_read_byte((uint8_t *)(addr_PRessureRef));
	PRessureRef_Valve = eeprom.read(eeprom.pageSet, eeprom.addr_PRessureRef_Valve); //eeprom_read_byte((uint8_t *)(addr_PRessureRef_Valve));
	PRessurePer = eeprom.read(eeprom.pageSet, eeprom.addr_PRessurePer); //eeprom_read_byte((uint8_t *)(addr_PREssurePer));
	PRessureMax_Sensor = eeprom.read(eeprom.pageSet, eeprom.addr_PRessureMax_Sensor); //eeprom_read_byte((uint8_t *)(addr_PRessureMax_Sensor));

	nTM = eeprom.read(eeprom.pageSet, eeprom.addr_nTM); //eeprom_read_byte((uint8_t *)(addr_nTM));

	int i;
	for(i=0;i<9;i++)
	{
		HourOnTM[i] = eeprom.read(eeprom.pageSet, eeprom.addr_HourOnTM+i); //eeprom_read_byte((uint8_t *)(addr_HourOnTM+i));
		MinOnTM[i] = eeprom.read(eeprom.pageSet, eeprom.addr_MinOnTM+i);//eeprom_read_byte((uint8_t *)(addr_MinOnTM+i));
	}
}
void ACIONNA::handleMessage()
{
/*
$0X;				Verificar detalhes - Detalhes simples (tempo).
	$00;			- Detalhes simples (tempo).
	$01;			- Verifica histórico de quando ligou e desligou;
	$02;			- Mostra tempo que falta para ligar;
		$02:c;		- Zera o tempo;
		$02:c:30;	- Ajusta novo tempo para 30 min;
		$02:s:090;	- Tempo máximo ligado para 90 min. Para não utilizar, colocar zero;
	$03;			- Verifica detalhes do motor, pressão e sensor termico;
		$03:s:72;	- Set pressure ref [m.c.a.];
		$03:v:32;	- Set pressure for valve load turn on and fill reservoir;
		$03:p:150;	- Set sensor max pressure ref to change the scale [psi];
		$03:b:85;	- Set to 85% the pressure min bellow the current pressure to avoid pipe broken;
	$04;			- Verifica detalhes do nível de água no poço e referência 10 bits;
		$04:0;		- Interrompe o envio continuo das variáveis de pressão e nível;
		$04:1;		- Envia continuamente valores de pressão e nível;
		$04:0900;	- Adiciona nova referência para os sensores de nível. Valor de 0 a 1023;
	$05;			- Mostra os horários que liga no modo $62;
	$06;			- Tempo ligado e tempo desligado;
	$07:x;			- ADC reference change.
		$07:0;		- AREF
		$07:1;		- AVCC with external cap at AREF pin
		$07:2;		- Internal 1.1 Voltage reference.
	$08;			- Motivo do reboot.
	$09;			- Reinicia o sistema.

$1:h:HHMMSS;		- Ajustes do calendário;
	$1:h:HHMMSS;	- Ajusta o horário do sistema;
	$1:h:123040;	- E.g. ajusta a hora para 12:30:40
	$1:d:DDMMAAAA;	- Ajusta a data do sistema no formato dia/mês/ano(4 dígitos);
	$1:d:04091986;	- E.g. Altera a data para 04/09/1986;
	$1:c;			- Shows the LSI current prescaler value;
	$1:c:40123;		- Set new prescaler value;

$2:DevName;			- Change bluetooth name;
	$2:Vassalo;		- Altera o nome do bluetooth para "Vassalo";

$4:x:				- Is this applied fo stm32f10xxx series only;
	$4:r:07;		- Read address 0x07 * 2 of currently page;
	$4:w:07:03;		- Write variable 3 on address 7 of currently page;
	$4:f:64:03;		- fill page 64 with 3 value;
	$4:e:64;		- erase page 64;

$3X;				- Acionamento do motor;
	$31;			- liga o motor;
	$30;			- desliga o motor;

$5:n:X; ou $5:hX:HHMM;
	$5:n:9;			- Configura para acionar 9 vezes. Necessário configurar 9 horários;
	$5:n:9;			- Configura o sistema para acionar uma única vez às 21:30 horas;
	$5:h1:2130;		- Configura o primeiro horário como 21:30 horas;
	$5:h8:0437;		- Configura o oitavo horário como 04:37 horas;

$6X;				- Modos de funcionamento;
	$60; 			- Sistema Desligado (nunca ligará);
	$61;			- Liga somente à noite. Sensor superior;
	$62;			- Liga nos determinados horários estipulados;
	$63;			- Função para válvula do reservatório;
	$64;			- Função para motobomba do reservatório;
*/
	// Tx - Transmitter
	if(enableDecode)
	{
		enableDecode = 0;

//		int i;
//		for(i=0;i<rLength;i++)
//		{
//			Serial1.println(sInstr[i]);
//		}
//		for(i=0;i<rLength;i++)
//		{
//			Serial1.println(sInstr[i],HEX);
//		}

		// Getting the opcode
		aux[0] = '0';
		aux[1] = sInstr[0];
		aux[2] = '\0';
		opcode = (uint8_t) atoi(aux);
//		Serial1.println("Got!");
		uint8_t statusCommand = 0;

		switch (opcode)
		{
// -----------------------------------------------------------------
			case 0:		// Check status
			{
				aux[0] = '0';
				aux[1] = sInstr[1];
				aux[2] = '\0';
				statusCommand = (uint8_t) atoi(aux);

				switch (statusCommand)
				{
					// ----------
					// $02:c;  -> clear time counter;
					// $02:c:mm;  -> set time counter ref;
					case 0:	// $00:1; or $00;
					{
						if(sInstr[2]==':' && sInstr[4]==';')
						{
							aux[0] = '0';
							aux[1] = sInstr[3];
							aux[2] = '\0';
							flag_debug_time = (uint8_t) atoi(aux);
						}
						else
						{
							summary_Print(statusCommand);
						}
					}
					case 2:
					{
						if(sInstr[2]==':' && sInstr[3]=='c')
						{
							if(sInstr[4] == ';')
							{
								flag_waitPowerOn = 0;
								waitPowerOn_min = 0;
								waitPowerOn_sec = 0;
							}
							else if(sInstr[4] ==':' && sInstr[7] == ';')
							{
								aux[0] = sInstr[5];
								aux[1] = sInstr[6];
								aux[2] = '\0';
								waitPowerOn_min_standBy = (uint8_t) atoi(aux);

								eeprom.write(eeprom.pageSet, eeprom.addr_standBy_min, waitPowerOn_min_standBy);
								//eeprom_write_byte((uint8_t *)(addr_standBy_min), waitPowerOn_min_standBy);

//								Serial.print("powerOn min:");
//								Serial.println(powerOn_min_Standy);
							}
						}//$02:s:129;
						else if(sInstr[2] == ':' && sInstr[3] == 's' && sInstr[4] == ':' && sInstr[8] == ';')
						{
							aux2[0] = '0';
							aux2[1] = sInstr[5];
							aux2[2] = sInstr[6];
							aux2[3] = sInstr[7];
							aux2[4] = '\0';
							motorTimerE = (uint16_t) atoi(aux2);

							eeprom.write(eeprom.pageSet, eeprom.addr_motorTimerE, motorTimerE);

//							uint8_t lbyteRef = 0, hbyteRef = 0;
//							lbyteRef = motorTimerE;
//							hbyteRef = (motorTimerE >> 8);

//							eeprom_write_byte((uint8_t *)(addr_motorTimerE+1), hbyteRef);
//							eeprom_write_byte((uint8_t *)(addr_motorTimerE), lbyteRef);
						}
						summary_Print(statusCommand);
					}
					break;
					// ------------------------------
					case 3:// $03:s:68;
						if(sInstr[2]==':' && sInstr[3] == 's' && sInstr[4] == ':' && sInstr[7] == ';')
						{
							aux[0] = sInstr[5];
							aux[1] = sInstr[6];
							aux[2] = '\0';
							PRessureRef = (uint8_t) atoi(aux);
							eeprom.write(eeprom.pageSet, eeprom.addr_PRessureRef, PRessureRef);
							//eeprom_write_byte((uint8_t *)(addr_PRessureRef), PRessureRef);

							sprintf(Serial.buffer,"PRessRef: %d", PRessureRef);
							Serial.println(Serial.buffer);
						}
						else if(sInstr[2]==':' && sInstr[3] == 'v' && sInstr[4] == ':' && sInstr[7] == ';')
						{
							aux[0] = sInstr[5];
							aux[1] = sInstr[6];
							aux[2] = '\0';
							PRessureRef_Valve = (uint8_t) atoi(aux);
							eeprom.write(eeprom.pageSet, eeprom.addr_PRessureRef_Valve, PRessureRef_Valve);
							//eeprom_write_byte((uint8_t *)(addr_PRessureRef_Valve), PRessureRef_Valve);

							sprintf(Serial.buffer,"PRessRef_Valve: %d", PRessureRef_Valve);
							Serial.println(Serial.buffer);
						}
						else if(sInstr[2]==':' && sInstr[3] == 'p' && sInstr[4] == ':' && sInstr[8] == ';')
						{// $03:p:150;
							aux2[0] = '0';
							aux2[1] = sInstr[5];
							aux2[2] = sInstr[6];
							aux2[3] = sInstr[7];
							aux2[4] = '\0';
							PRessureMax_Sensor = (uint8_t) atoi(aux2);

							eeprom.write(eeprom.pageSet, eeprom.addr_PRessureMax_Sensor, PRessureMax_Sensor);
//							eeprom_write_byte((uint8_t *)(addr_PRessureMax_Sensor), PRessureMax_Sensor);
						}
						else if(sInstr[2]==':' && sInstr[3] == 'b' && sInstr[4] == ':' && sInstr[7] == ';')
						{
							aux[0] = sInstr[5];
							aux[1] = sInstr[6];
							aux[2] = '\0';
							PRessurePer = (uint8_t) atoi(aux);
							eeprom.write(eeprom.pageSet, eeprom.addr_PRessurePer, PRessurePer);
							//eeprom_write_byte((uint8_t *)(addr_PREssurePer), PRessurePer);
						}
						else
							summary_Print(statusCommand);
						break;
					// ------------------------------
					case 4: // $04:1;
						if(sInstr[2]==':' && sInstr[4]==';')
						{
							aux[0] = '0';
							aux[1] = sInstr[3];
							aux[2] = '\0';
							flag_debug = (uint8_t) atoi(aux);
						}//$04:s:0900;
						else if(sInstr[2]==':' && sInstr[3]=='s' && sInstr[4]==':' && sInstr[9]==';')
						{
							aux2[0] = sInstr[5];
							aux2[1] = sInstr[6];
							aux2[2] = sInstr[7];
							aux2[3] = sInstr[8];
							aux2[4] = '\0';

							levelRef_10bit = (uint16_t) atoi(aux2);

//							uint8_t lbyteRef = 0, hbyteRef = 0;
//							lbyteRef = levelRef_10bit;
//							hbyteRef = (levelRef_10bit >> 8);

							eeprom.write(eeprom.pageSet, eeprom.addr_LevelRef, levelRef_10bit);

							//eeprom_write_byte((uint8_t *)(addr_LevelRef+1), hbyteRef);
							//eeprom_write_byte((uint8_t *)(addr_LevelRef), lbyteRef);
						}
						summary_Print(statusCommand);
						sprintf(Serial.buffer,"Ref: %d", levelRef_10bit);
						Serial.println(Serial.buffer);
						break;
					// ------------------------------
					case 7:
						if(sInstr[2]==':' && sInstr[4]==';')
						{
							aux[0] = '0';
							aux[1] = sInstr[3];
							aux[2] = '\0';
							uint8_t adcCommand = (uint8_t) atoi(aux);

							switch (adcCommand)
							{
//								case 0:
//									ADMUX &=  ~(1<<REFS1);		// AREF, Internal Vref turned off
//									ADMUX &=  ~(1<<REFS0);
//									Serial.println("AREF");
//									break;
//
//								case 1:
//									ADMUX &=  ~(1<<REFS1);		// AVCC with external capacitor at AREF pin
//									ADMUX |=   (1<<REFS0);
//									Serial.println("AVCC");
//									break;
//
//								case 2:
//									ADMUX |=   (1<<REFS1);		// Internal 1.1V Voltage Reference with external capacitor at AREF pin
//									ADMUX |=   (1<<REFS0);
//									Serial.println("1.1V");
//									break;
							}
						}
						break;
					// ------------------------------
					case 9:
						Serial.println("Rebooting...");
						NVIC_SystemReset();
						//wdt_enable(WDTO_15MS);
//						flag_reset = 1;
						break;

					default:
						summary_Print(statusCommand);
						break;
				}
			}
			break;
// -----------------------------------------------------------------
			case 1: 	// Setup calendar
			{
				// Set-up clock -> $1:h:HHMMSS;
				if(sInstr[1]==':' && sInstr[2]=='h' && sInstr[3]==':' && sInstr[10]==';')
				{
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					tm.Hour = (uint8_t) atoi(aux);

					aux[0] = sInstr[6];
					aux[1] = sInstr[7];
					aux[2] = '\0';
					tm.Minute = (uint8_t) atoi(aux);

					aux[0] = sInstr[8];
					aux[1] = sInstr[9];
					aux[2] = '\0';
					tm.Second = (uint8_t) atoi(aux);

