thmalmeida/STM32F10y/src/acionna.h
//					RTC.write(tm);
					rtc.write(tm);
					summary_Print(0);
				}
				// 	Set-up date -> $1:d:DDMMAAAA;
				else if(sInstr[1]==':' && sInstr[2]=='d' && sInstr[3]==':' && sInstr[12]==';')
				{
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					tm.Day = (uint8_t) atoi(aux);

					aux[0] = sInstr[6];
					aux[1] = sInstr[7];
					aux[2] = '\0';
					tm.Month = (uint8_t) atoi(aux);

					char aux2[5];
					aux2[0] = sInstr[8];
					aux2[1] = sInstr[9];
					aux2[2] = sInstr[10];
					aux2[3] = sInstr[11];
					aux2[4] = '\0';
					tm.Year = (uint8_t) (atoi(aux2)-1970);

//					RTC.write(tm);
					rtc.write(tm);

					summary_Print(0);

				}
				// Set-up date -> $1:d:DDMMAAAA;
				else if(sInstr[1]==':' && sInstr[2]=='c' && sInstr[3]==':' && sInstr[9]==';')
				{	// $1:c:40123;
					char aux3[6];
					aux3[0] = sInstr[4];
					aux3[1] = sInstr[5];
					aux3[2] = sInstr[6];
					aux3[3] = sInstr[7];
					aux3[4] = sInstr[8];
					aux3[5] = '\0';
					rtc.rtc_PRL = (uint32_t) atoi(aux3);

					rtc.setRTC_DIV(rtc.rtc_PRL);
					sprintf(Serial.buffer,"PRLw: %ld", rtc.rtc_PRL);
					Serial.println(Serial.buffer);

					eeprom.write(eeprom.pageSet, eeprom.addr_rtc_PRL, (uint16_t) rtc.rtc_PRL);

					sprintf(Serial.buffer,"PRLr: %ld", rtc.getRTC_DIV());
					Serial.println(Serial.buffer);
				}
				else if(sInstr[1]==':' && sInstr[2]=='c' && sInstr[3]==';')
				{
					sprintf(Serial.buffer,"PRLreg: %lu, PRLflash: %u", rtc.getRTC_DIV(), eeprom.read(eeprom.pageSet, eeprom.addr_rtc_PRL));
					Serial.println(Serial.buffer);
				}
				// $1:s:S;
				else if(sInstr[1]==':' && sInstr[2]=='s' && sInstr[3]==':' && sInstr[5]==';')
				{
					aux[0] = '0';
					aux[1] = sInstr[4];
					aux[2] = '\0';
					rtc.rtc_clkSource = (uint8_t) atoi(aux);

					eeprom.write(eeprom.pageSet, eeprom.addr_rtc_clkSource, rtc.rtc_clkSource);
					rtc.bkpDomainReset();
					rtc.begin_rtc(rtc.rtc_clkSource, rtc.rtc_PRL);

					sprintf(Serial.buffer,"rtcSource: %u", rtc.rtc_clkSource);
					Serial.println(Serial.buffer);
				}
				else if(sInstr[1]==':' && sInstr[2]=='s' && sInstr[3]==';')
				{
					eeprom.read(eeprom.pageSet, eeprom.addr_rtc_clkSource);

					summary_Print(0);
					sprintf(Serial.buffer,"rtcSource: %u", rtc.rtc_clkSource);
					Serial.println(Serial.buffer);
				}
			}
			break;
// -----------------------------------------------------------------
			case 2:		// Setup Bluetooth device name
			{
				// Setup clock -> $2:BluetoothName;
				char aux_str[sInstr_SIZE], aux_str2[sInstr_SIZE+7];
				uint8_t k1=0;
				if(sInstr[1]==':')
				{
					// 3 because 2 and : count 2 characters and one more for '\0'
					while((k1<sInstr_SIZE-3) && sInstr[k1] != ';')
					{
						aux_str[k1] = sInstr[k1+2];
						k1++;
//						Serial.println(k1);
					}

					aux_str[k1-2] = '\0';
					Serial.println("Disconnect!");
//					wdt_reset();
//					_delay_ms(3000);
//					wdt_reset();
//					_delay_ms(3000);
//					wdt_reset();
//					_delay_ms(3000);
//					strcpy(aux_str2,"AT");
//					Serial.print(aux_str2);
					//wdt_reset();
					_delay_ms(3000);
					strcpy(aux_str2,"AT+NAME");
					strcat(aux_str2,aux_str);
					Serial.print(aux_str2);
					//wdt_reset();
					_delay_ms(1000);
				}
			}
			break;
// -----------------------------------------------------------------
			case 3:		// Set motor ON/OFF
			{
				uint8_t motorCommand;
				aux[0] = '0';
				aux[1] = sInstr[1];
				aux[2] = '\0';
				motorCommand = (uint8_t) atoi(aux);

				if (motorCommand && (!motorStatus))
				{
					motor_start();
				}
				else
				{
					motor_stop(0x06);
				}

				summary_Print(3);
			}
			break;
// -----------------------------------------------------------------
			case 4: 	// FLASH store test, //$4:r:23; and $4:w:23:03;
			{
				if(sInstr[1]==':' && sInstr[2]=='r' && sInstr[3]==':' && sInstr[6]==';')
				{	// $4:r:05; read 05*2 address of page block
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					uint8_t addrt = (uint8_t) atoi(aux);
					uint8_t var = eeprom.read(eeprom.pageSet, addrt);
					sprintf(Serial.buffer,"EE read: %d ", var);
					Serial.println(Serial.buffer);

					sprintf(Serial.buffer,"Page %d ", eeprom.pageSet);
					Serial.println(Serial.buffer);

					sprintf(Serial.buffer,"Address %X ", (unsigned int) eeprom.pageAddress(eeprom.pageSet));
					Serial.println(Serial.buffer);
				}
				if(sInstr[1]==':' && sInstr[2]=='w' && sInstr[3]==':' && sInstr[6]==':' && sInstr[9]==';')
				{	// $4:w:03:07;
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					uint8_t addrt = (uint8_t) atoi(aux);

					aux[0] = sInstr[7];
					aux[1] = sInstr[8];
					aux[2] = '\0';
					uint8_t var = (uint8_t) atoi(aux);

					eeprom.write(eeprom.pageSet, addrt, var);
					sprintf(Serial.buffer,"EE write: %d ", var);
					Serial.println(Serial.buffer);

					var = eeprom.read(eeprom.pageSet, addrt);
					sprintf(Serial.buffer,"EE read2: %d ", var);
					Serial.println(Serial.buffer);

					sprintf(Serial.buffer,"Page %d ", eeprom.pageSet);
					Serial.println(Serial.buffer);

					sprintf(Serial.buffer,"Address %X ", (unsigned int) eeprom.pageAddress(eeprom.pageSet));
					Serial.println(Serial.buffer);
				}
				if(sInstr[1]==':' && sInstr[2]=='f' && sInstr[3]==':' && sInstr[6]==':' && sInstr[9]==';')
				{	// $4:f:64:07;	fill page 64 with 07 value;
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					uint8_t page = (uint8_t) atoi(aux);

					aux[0] = sInstr[7];
					aux[1] = sInstr[8];
					aux[2] = '\0';
					uint8_t var = (uint8_t) atoi(aux);



					eeprom.writePage(page, (var << 8 | var));
					sprintf(Serial.buffer,"Filled page %d ", page);
					Serial.println(Serial.buffer);

					sprintf(Serial.buffer,"Address %X ", (unsigned int) eeprom.pageAddress(page));
					Serial.println(Serial.buffer);
				}
				if(sInstr[1]==':' && sInstr[2]=='e' && sInstr[3]==':' && sInstr[6]==';')
				{	// $4:e:64;	erase page 64
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					uint8_t page = (uint8_t) atoi(aux);

					eeprom.erasePage(page);
					sprintf(Serial.buffer,":Page %d erased!", page);
					Serial.println(Serial.buffer);

					sprintf(Serial.buffer,"Address %X ", (unsigned int) eeprom.pageAddress(page));
					Serial.println(Serial.buffer);
				}
				break;
			}
// -----------------------------------------------------------------
			case 5: 	// Command is $5:h1:2130;
			{
				if(sInstr[1]==':' && sInstr[2]=='h' && sInstr[4]==':' && sInstr[9]==';')
				{
					aux[0] = '0';
					aux[1] = sInstr[3];
					aux[2] = '\0';
					uint8_t indexV = (uint8_t) atoi(aux);

					aux[0] = sInstr[5];
					aux[1] = sInstr[6];
					aux[2] = '\0';
					HourOnTM[indexV-1] = (uint8_t) atoi(aux);
					eeprom.write(eeprom.pageSet, eeprom.addr_HourOnTM+indexV-1, HourOnTM[indexV-1]);
					//eeprom_write_byte(( uint8_t *)(addr_HourOnTM+indexV-1), HourOnTM[indexV-1]);

