thmalmeida/STM32F10y/src/acionna.h
					aux[0] = sInstr[7];
					aux[1] = sInstr[8];
					aux[2] = '\0';
					MinOnTM[indexV-1] = (uint8_t) atoi(aux);
					eeprom.write(eeprom.pageSet, eeprom.addr_MinOnTM+indexV-1, MinOnTM[indexV-1]);
//					eeprom_write_byte(( uint8_t *)(addr_MinOnTM+indexV-1), MinOnTM[indexV-1]);

					summary_Print(5);
				}
				else if(sInstr[1]==':' && sInstr[2]=='n' && sInstr[3]==':' && sInstr[5]==';')
				{
					aux[0] = '0';
					aux[1] = sInstr[4];
					aux[2] = '\0';

					nTM = (uint8_t) atoi(aux);
					eeprom.write(eeprom.pageSet, eeprom.addr_nTM, nTM);
					//eeprom_write_byte(( uint8_t *)(addr_nTM), nTM);

					summary_Print(5);
				}
				else if(sInstr[1]==';')
				{
					summary_Print(5);
				}
			}
			break;
// ----------------------------------------------------------------
			case 6:		// Set working mode
			{
				aux[0] = '0';
				aux[1] = sInstr[1];
				aux[2] = '\0';
				stateMode = (uint8_t) atoi(aux);
				eeprom.write(eeprom.pageSet, eeprom.addr_stateMode, stateMode);
//				//eeprom_write_byte(( uint8_t *)(addr_stateMode), stateMode);

				summary_Print(0);
			}
			break;
// -----------------------------------------------------------------
			case 7:		// nRF24L01p test functions;
			{
				// $7:s:
				uint8_t state =9;
				if(sInstr[1]==':' && sInstr[2]=='s' && sInstr[3]==';')
				{
					radio.begin_nRF24L01p();
				}
				else if(sInstr[1]==':' && sInstr[2]=='g' && sInstr[3]==';')
				{
					state = radio.get_stateMode();
				}
				else if(sInstr[1]==':' && sInstr[2]=='t' && sInstr[3]==';')
				{
					state = radio.set_mode_tx(ENABLE);
				}
				else if(sInstr[1]==':' && sInstr[2]=='r' && sInstr[3]==';')
				{
					state = radio.set_mode_rx(ENABLE);
				}
				else if(sInstr[1]==':' && sInstr[2]=='b' && sInstr[3]==';')
				{
					state = radio.set_mode_standbyI();
				}
				else if(sInstr[1]==':' && sInstr[2]=='p' && sInstr[3]==';')
				{
					state = radio.set_mode_powerDown();
				}

				sprintf(Serial.buffer,"state: %u", state);
				Serial.println(Serial.buffer);

//				radio.begin_nRF24L01p();
//				radio.set_250kbps();
//				if(sInstr[1]==':' && sInstr[2]=='h' && sInstr[4]==':' && sInstr[9]==';')
//				{
//					aux[0] = '0';
//					aux[1] = sInstr[3];
//					aux[2] = '\0';
//					uint8_t indexV = (uint8_t) atoi(aux);
//
//					aux[0] = sInstr[5];
//					aux[1] = sInstr[6];
//					aux[2] = '\0';
//					HourOnTM[indexV-1] = (uint8_t) atoi(aux);
//					eeprom.write(eeprom.pageSet, eeprom.addr_HourOnTM+indexV-1, HourOnTM[indexV-1]);
//					//eeprom_write_byte(( uint8_t *)(addr_HourOnTM+indexV-1), HourOnTM[indexV-1]);
//
//					aux[0] = sInstr[7];
//					aux[1] = sInstr[8];
//					aux[2] = '\0';
//					MinOnTM[indexV-1] = (uint8_t) atoi(aux);
//					eeprom.write(eeprom.pageSet, eeprom.addr_MinOnTM+indexV-1, MinOnTM[indexV-1]);
////					eeprom_write_byte(( uint8_t *)(addr_MinOnTM+indexV-1), MinOnTM[indexV-1]);
//
//					summary_Print(5);
			}
			break;
// -----------------------------------------------------------------
			default:
				summary_Print(10);
				break;
// -----------------------------------------------------------------
		}
		memset(sInstr,0,sizeof(sInstr));	// Clear all vector;
	}
}
void ACIONNA::comm_Bluetooth()
{
	// Rx - Always listening
//	uint8_t j2 =0;
	while((Serial.available()>0))	// Reading from serial
	{
		inChar = Serial.read();

		if(inChar=='$')
		{
			j2 = 0;
			flag_frameStartBT = 1;
//			Serial.println("Frame Start!");
		}

		if(flag_frameStartBT)
			sInstrBluetooth[j2] = inChar;

//		sprintf(Serial.buffer,"J= %d",j2);
//		Serial.println(Serial.buffer);

		j2++;

		if(j2>=sizeof(sInstrBluetooth))
		{
			memset(sInstrBluetooth,0,sizeof(sInstrBluetooth));
			j2=0;
//			Serial.println("ZEROU! sIntr BLuetooth Buffer!");
		}

		if(inChar==';')
		{
//			Serial.println("Encontrou ; !");
			if(flag_frameStartBT)
			{
//				Serial.println("Frame Stop!");
				flag_frameStartBT = 0;
				rLength = j2;
				j2 = 0;
				enableTranslate_Bluetooth = 1;
			}
		}
	}
//	flag_frameStart = 0;

	if(enableTranslate_Bluetooth)
	{
//		Serial.println("enableTranslate_Bluetooth");
		enableTranslate_Bluetooth = 0;

		char *pi0, *pf0;
		pi0 = strchr(sInstrBluetooth,'$');
		pf0 = strchr(sInstrBluetooth,';');

		if(pi0!=NULL)
		{
			uint8_t l0=0;
			l0 = pf0 - pi0;

			int i;
			for(i=1;i<=l0;i++)
			{
				sInstr[i-1] = pi0[i];
//				Serial.write(sInstr[i-1]);
			}
			memset(sInstrBluetooth,0,sizeof(sInstrBluetooth));
	//		Serial.println(sInstr);

			enableDecode = 1;
		}
		else
		{
//			Serial.println("Err");
//			Serial.write(pi0[0]);
//			Serial.write(pf0[0]);
		}
	}
}


#endif /* HARDWARE_H_ */

#endif /* ACIONNA_H_ */
